# vim: syntax=ruby filetype=ruby

# rcm: dotfile management
brew "rcm"

# Lets us do `brew services restart postgres`, etc
# tap "homebrew/services"

# Includes an updated CA bundle.
brew "curl"

brew "bat"
# brew "chrome-cli"
brew "fzf"
brew "git"
brew "graphicsmagick"
# brew "git-crypt"
brew "git-gui"
# brew "heroku"
# brew "pgrep"
brew "ripgrep"
brew "redis"
brew "tree"
brew "git-delta"
brew "libpq"
brew "libyaml"

# Slice and dice your CSV
# brew "xsv"

# macOS ships with version 2.8. Get version 3.4+ so `diff --color` works.
brew "diffutils"

# brew "moreutils"

# brew "zsh-syntax-highlighting"

# watch COMMAND runs COMMAND on a regular cadence
# brew "watch"

# Prompt: https://starship.rs
brew "starship"

# Git Large File Support
brew "git-lfs"

# Shell history
brew "atuin"

# GitHub CLI
brew "gh"

# JSON / YAML processing
brew "jq"
brew "yq"

# AWS
# brew "awscli"

# Git TUI
brew "lazygit"

# Process manager (Rails dev)
brew "overmind"

# Media
brew "ffmpeg"

# Networking
brew "wget"

# Git hooks
brew "lefthook"

# Node package manager
brew "pnpm"

# Fly.io
brew "flyctl"

# Version manager: replaces rbenv + fnm
brew "mise"

# PostgreSQL (binaries only — no auto-start, no initdb)
brew "postgresql@17"

# Neon DB CLI
brew "neonctl"

# AI / dev tools (all available in homebrew/core, no custom tap needed)
brew "agent-browser"
brew "mcp-toolbox"
brew "logdy"
brew "uv"

# Shopify CLI (requires tap)
tap "shopify/shopify"
brew "shopify/shopify/shopify-cli"

# Notes
cask "obsidian"

# 1Password CLI
# cask "1password-cli"
