# vim: syntax=ruby filetype=ruby

tap "thoughtbot/formulae"
# rcm: dotfile management
brew "rcm"
# parity: useful tools for Heroku development/staging/production
brew "parity"

# Lets us do `brew services restart postgres`, etc
tap "homebrew/services"

# Includes an updated CA bundle.
brew "curl"

brew "bat"
brew "chrome-cli"
brew "fd"
brew "fzf"
brew "git"
brew "graphicsmagick"
brew "git-crypt"
brew "git-gui"
brew "heroku"
brew "hexyl"
brew "hub"
brew "pgrep"
brew "ripgrep"
brew "redis"
brew "tag"
brew "tree"
# brew "vim"
brew "git-delta"

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew "jq"

# Slice and dice your CSV
brew "xsv"

# macOS ships with version 2.8. Get version 3.4+ so `diff --color` works.
brew "diffutils"

# so :Rtags works
brew "ctags"

brew "youtube-dl"
# youtube-dl uses ffmpeg to automatically fix some issues in downloaded files
brew "ffmpeg"

# I love `sponge` so much.
brew "moreutils"

# a Postgres pager

# rbenv version manager for Ruby
brew "rbenv"
brew "rbenv-default-gems"

# Version manager for Node
brew "fnm"

brew "zsh-syntax-highlighting"

# watch COMMAND runs COMMAND on a regular cadence
brew "watch"

# Prompt: https://starship.rs
brew "starship"

# Git Large File Support
brew "git-lfs"
