# vim: syntax=ruby filetype=ruby

# rcm: dotfile management
brew "rcm"

# Lets us do `brew services restart postgres`, etc
# tap "homebrew/services"

# Includes an updated CA bundle.
brew "curl"

brew "bat"
brew "chrome-cli"
# brew "fd"
brew "fzf"
brew "git"
brew "graphicsmagick"
# brew "git-crypt"
brew "git-gui"
# brew "heroku"
# brew "pgrep"
brew "ripgrep"
brew "redis"
brew "tree"
# brew "vim"
brew "git-delta"

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
# brew "jq"

# Slice and dice your CSV
# brew "xsv"

# macOS ships with version 2.8. Get version 3.4+ so `diff --color` works.
brew "diffutils"

# brew "ffmpeg"

# brew "moreutils"

brew "rbenv"

# Version manager for Node
brew "fnm"

# brew "zsh-syntax-highlighting"

# watch COMMAND runs COMMAND on a regular cadence
# brew "watch"

# Prompt: https://starship.rs
brew "starship"

# Git Large File Support
brew "git-lfs"
